# Append Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurveLoop..::..Append Method
CurveLoop Class See Also
---
Append the curve to this loop.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public void Append(
	Curve curve
)
```

Visual Basic
---
```text
Public Sub Append ( _
	curve As Curve _
)
```

Visual C++
---
```text
public:
void Append(
	Curve^ curve
)
```

# ### Parameters
curve
    Type: Autodesk.Revit.DB..::..Curve The curve.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The input curve points to a helical curve and is not supported for this operation. -or- Throws if the input curve makes the loop not contiguous. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
CurveLoop Class
Autodesk.Revit.DB Namespace